Repository: jsquyres/pxlib-and-pxview
Catalog: pxview/po/*.po
Languages: de

source: Allocate memory for string buffer
de: Alloziere Speicher für String-Buffer.

source: Get more memory for string buffer.
de: Alloziere weiteren Speicher für String-Buffer.

source: %s reads a paradox file and outputs the file in CSV format.
de: %s liest eine Paradox Datei und gibt den Inhalt im CSV-Format aus.

source: %s reads a paradox file and outputs the file in SQL format.
de: %s liest eine Paradox Datei und gibt den Inhalt im SQL-Format aus.

source: %s reads a paradox file and outputs the file in HTML format.
de: %s liest eine Paradox Datei und gibt den Inhalt im HTML-Format aus.

source: %s reads a paradox file and writes the output into a sqlite database.
de: %s liest eine Paradox Datei und schreibt den Inhalt in eine sqlite Datenbank.

source: %s reads a paradox file and outputs information about the file or dumps the content in CSV, HTML, SQL or sqlite format.
de: %s liest eine Paradox Datei und zeigt entweder Informationen über die Datei an oder gibt den Inhalt im CSV-, HTML-, SQL- oder sqlite-Format aus.

source: Usage: %s [OPTIONS] FILE
de: Aufruf: %s [OPTION] DATEI

source: General options:
de: Allgemeine Optionen:

source: -h, --help this usage information.
de: -h, --help diese Hilfe.

source: --version show version information.
de: --version zeige Programmversion.

source: -v, --verbose be more verbose.
de: -v, --verbose mehr Informationen anzeigen.

source: --use-gsf use gsf library to read input file.
de: --use-gsf benutze gsf-Bibliothek zum Lesen der Eingabedatei.

source: Options to select output mode:
de: Optionen, die die Ausgabe betreffen:

source: -i, --info show information about file.
de: -i, --info zeige Informationen über eine Datei.

source: -c, --csv dump records in CSV format.
de: -c, --csv gebe Datensätze im CSV-Format aus.

source: -s, --sql dump records in SQL format.
de: -s, --sql gebe Datensätze im SQL-Format aus.

source: -q, --sqlite dump records into sqlite database.
de: -q, --sqlite schreibe Datensätze in eine sqlite Datenbank.

source: -x, --html dump records in HTML format.
de: -x, --html gebe Datensätze im HTML-Format aus.

source: -t, --schema output schema of database.
de: -t, --schema gebe Schema der Datenbank aus.

source: --mode=MODE set output mode (info, csv, sql, sqlite, html or schema).
de: --mode=MODE setze Ausgabemodus (info, csv, sql, sqlite, html oder schema).

source: -o, --output-file=FILE output data into file instead of stdout.
de: -o, --output-file=DATEI schreibe Ausgabe in Datei statt nach stdout.

source: --output-deleted output also records which were deleted.
de: --output-deleted gebe auch gelöschte Datensätze aus.

source: --fields=REGEX extended regular expression to select fields.
de: --fields=REGEX erweiterter regulärer Ausdruck zur Auswahl von Feldern.

source: -r, --recode=ENCODING sets the target encoding.
de: -r, --recode=ENCODING setzt Zielkodierung

source: -n, --primary-index-file=FILE read primary index from file.
de: -n, --primary-index-file=DATEI lese Primärindex aus Datei.

source: --timestamp-format=FORMAT Set format for timestamps (default Y-m-d H:i:s).
de: --timestamp-format=FORMAT Setze Format für Zeitstempelausgabe (Voreinstellung Y-m-d H:i:s).

source: --time-format=FORMAT Set format for times (default H:i:s).
de: --time-format=FORMAT Setze Format für Zeitausgabe (Voreinstellung H:i:s).

source: --date-format=FORMAT Set format for dates (default Y-m-d).
de: --date-format=FORMAT Setze Format für Datumsausgabe (Voreinstellung Y-m-d).

source: Options to handle blob files:
de: Optionen, die BLOB-Dateien betreffen:

source: -b, --blobfile=FILE read blob data from file.
de: -b, --blobfile=DATEI lese Blobs aus Datei.

source: -p, --blobprefix=PREFIX prefix for all created files with blob data.
de: -p, --blobprefix=PRÄFIX Präfix für erzeugte Blob-Dateien.

source: --blobextension=EXT extension for all created files with blob data.
de: --blobextension=EXT Dateiendung für erzeugte Blob-Dateien.

source: Options for html ouput:
de: Optionen, die die HTML-Ausgabe betreffen:

source: --tablename=NAME overwrite name of database table.
de: --tablename=NAME überschreibe den Namen der Datenbanktable.

source: --mark-deleted add extra column with 1 for deleted records.
de: --mark-deleted Ausgabe einer zusätzlichen Spalte mit 1 für gelöschte DS.

source: Options for sql and sqlite ouput:
de: Optionen, die die SQL- und SQLite-Ausgabe betreffen:

source: --delete-table delete existing sql database table.
de: --delete-table lösche bestehende SQL Datenbanktable.

source: --skip-schema do not output database table schema.
de: --skip-schema gebe Schema der Datenbank nicht aus.

source: --short-insert use short insert statements.
de: --short-insert benutze kurze Insert Anweisungen.

source: --set-sql-type=SPEC sets the type for a sql field.
de: --set-sql-type=SPEC setze Typ eines SQL-Feldes.

source: --empty-string-is-null tread empty string as null.
de: --empty-string-is-null behandel leere Strings als NULL.

source: Options for sql output:
de: Optionen, die die SQL-Ausgabe betreffen:

source: --use-copy use COPY instead of INSERT statement.
de: --use-copy benutze COPY anstatt der INSERT-Anweisung.

source: Options for csv ouput:
de: Optionen, die die CSV-Ausgabe betreffen:

source: --separator=CHAR character used to separate field values (default is ',').
de: --separator=CHAR Zeichen, das zur Trennung von Feldern benutzt wird (voreingestellt is ',').

source: --enclosure=CHAR character used to enclose field values (default is '"').
de: --enclosure=CHAR Zeichen, das zum Einschließen von Feldern benutzt wird (voreingestellt is '"').

source: --without-head Turn off first line with field names.
de: --without-head Keine Ausgabe der ersten Zeile mit Feldnamen.

source: If you do not specify any of the options -i, -c, -s, -x, -q or -t then -i will be used.
de: Wenn Sie keine der Optionen -i, -c, -s, -x, -q oder -t angeben, dann wird die Option -i verwendet.

source: The option --fields will only affect csv, html, sql and sqlite output.
de: Die Option --fields beeinflusst nur die CSV-, HTML-, SQL und sqlite-Ausgabe.

source: Supported output formats:
de: Unterstützte Ausgabeformate:

source: libpx uses librecode for recoding.
de: libpx benutzt librecode zum reencodieren.

source: libpx uses iconv for recoding.
de: libpx benutzt iconv zum reencodieren.

source: libpx has no support for recoding.
de: libpx unterstützt nicht das reencodieren.

source: libpx has been compiled for big endian architecture.
de: libpx wurde für Architekturen mit big endian übersetzt.

source: libpx has been compiled for little endian architecture.
de: libpx wurde für Architekturen mit little endian übersetzt.

source: libpx has gsf support: %s
de: libpx hat Unterstützung für die gsf-Bibliothek: %s

source: Yes
de: Ja

source: No
de: Nein

source: libpx has version: %d.%d.%d
de: libpx ist Version: %d.%d.%d

source: No sqlite support available.
de: Keine sqlite-Unterstützung verfügbar.

source: Unknown paradox type specified with --set-sql-type.
de: Unbekannter Paradox Feldtyp wurde mit --set-sql-type versucht zu setzen.

source: Argument of --set-sql-type does not contain the delimiting character ':'.
de: Argument von --set-sql-type beinhaltet nicht das Trennzeichen ':'.

source: Predefined paradox to sql field type mapping:
de: Vordefinierte Paradox nach SQL Feldtyp-Zuordnung:

source: You must at least specify an input file.
de: Sie müssen mindestes eine Eingabedatei angegeben.

source: sqlite database cannot be written to stdout.
de: sqlite-Datenbank kann nicht nach stdout geschrieben werden.

source: Could not open output file.
de: Konnte Ausgabedate nicht öffnen.

source: Could not create new paradox instance.
de: Konnte eine neue Paradox-Instanz nicht anlegen.

source: Could not open gsf input file.
de: Konnte Eingabedatei mit gsf-Bibliothek nicht öffnen.

source: Could not open input file.
de: Sie müssen mindestes eine Eingabedatei angegeben.

source: Could not open primary index file.
de: Konnte die Primärindexdatei nicht öffnen.

source: Could not read primary index file.
de: Konnte die Primärindexdatei nicht lesen.

source: Could not add primary index file.
de: Konnte den Primärindex nicht hinzufügen.

source: Could not open blob file.
de: Konnte Blob-Datei nicht öffnen.

source: File Version: %1.1f
de: Datei Version: %1.1f

source: File Type:
de: Dateityp:

source: indexed .DB data file
de: indizierte .DB Datendatei

source: primary index .PX file
de: Primärindex .PX Datei

source: non-indexed .DB data file
de: Nicht-indizierte .DB Datendatei

source: non-incrementing secondary index .Xnn file
de: Nicht inkrementierende, sekundäre Index .Xnn Datei

source: secondary index .Ynn file (inc or non-inc)
de: Sekundre Index .Ynn Datei (nicht- und inkrementierend)

source: incrementing secondary index .Xnn file
de: Inkrementierende, sekundäre Index .Xnn Datei

source: non-incrementing secondary index .XGn file
de: Nicht inkrementierende, sekundäre Index .XGn Datei

source: secondary index .YGn file (inc or non inc)
de: Sekundre Index .YGn Datei (nicht- und inkrementierend)

source: incrementing secondary index .XGn file
de: Inkrementierende, sekundäre Index .XGn Datei

source: Tablename: %s
de: Tabellenname: %s

source: Num. of Records: %d
de: Anz. der Datensätze: %d

source: Theor. Num. of Rec.: %d
de: Theo. Anz. der Datensätze: %d

source: Num. of Fields: %d
de: Anz. der Felder: %d

source: Header size: %d (0x%X)
de: Größe der Präambel: %d (0x%X)

source: Max. Table size: %d (0x%X)
de: Max. Tabellengröße: %d (0x%X)

source: Num. of Data Blocks: %d
de: Anz. der Datenblöcke: %d

source: Num. of 1st Data Block: %d
de: Nr. des ersten Datenblocks: %d

source: Num. of last Data Block: %d
de: Nr. des letzten Datenblocks: %d

source: Num. of Index Field: %d
de: Num. des Indexfeldes: %d

source: Sort order of Field: %d
de: Sortierung des Feldes: %d

source: Num. of prim. Key fields: %d
de: Anz. der Primärschl.felder: %d

source: Next auto inc. value: %d
de: Näch. Auto ink. Wert: %d

source: Root index block number: %d
de: Num. des Index-Root-Blocks: %d

source: Num. of index levels: %d
de: Anzahl der Indexlevel: %d

source: Write protected: %d
de: Schreibschutz: %d

source: Encryption: 0x%X
de: Verschlüsselung: 0x%X

source: Update time: %d.%d.%d %d:%02d:%02d (%d)
de: Letzte Aktualisierung: %d.%d.%d %d:%02d:%02d (%d)

source: Record size: %d (0x%X)
de: Größe eines Datens.: %d (0x%X)

source: Sort order: %d (0x%X)
de: Sortierreihenfolge: %d (0x%X)

source: Auto increment: %d (0x%X)
de: Auto inkrement: %d (0x%X)

source: Modified Flags 1: %d (0x%X)
de: Modifiziert Flags 1: %d (0x%X)

source: Modified Flags 2: %d (0x%X)
de: Modifiziert Flags 2 %d (0x%X)

source: Fieldname | Type
de: Feldname | Typ

source: Record length | %d (0x%X)
de: Größe eines Datens.: %d (0x%X)

source: Schema output is only reasonable for DB files.
de: Schema-Ausgabe macht nur bei DB-Dateien Sinn.

source: Could not compile regular expression to select fields.
de: Konnte regulären Ausdruck nicht übersetzen.

source: Could not allocate memory for array of selected fields.
de: Konnte Speicher für Array der selektierten Felder nicht allozieren.

source: Allocate memory for record.
de: Alloziere Speicher für Datensatz.

source: Couldn't get record number %d
de: Konnte auf Datensatz Nummer %d nicht zugreifen.

source: SQL output is only reasonable for DB files.
de: SQL-Ausgabe macht nur bei DB-Dateien Sinn.

source: Could not allocate memory for record.
de: Konnte Speicher für Datensatz nicht allozieren.

source: Previous block number according to header:
de: Vorherige Blocknummer gemäß Header:

source: Next block number according to header:
de: Nächste Blocknummer gemäß Header:

source: Real block number in file:
de: Blocknummer in der Datei:

source: Block size:
de: Blockgröße:

source: Record number in block:
de: Datensatznummer innerhalb des Blocks:

source: Number of records in block:
de: Anzahl der Datensätze im Block:

source: Block position in file:
de: Blockposition in der Datei:

source: Record position in file:
de: Datensatzposition in der Datei:

source: Record deleted:
de: Datensatz gelöscht:
